program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3405.2.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 64, 1, 4]> x) {
            tensor<string, []> var_13_pad_type_0 = const()[name = tensor<string, []>("op_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_13_strides_0 = const()[name = tensor<string, []>("op_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> var_13_pad_0 = const()[name = tensor<string, []>("op_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_13_dilations_0 = const()[name = tensor<string, []>("op_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_13_groups_0 = const()[name = tensor<string, []>("op_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> x_to_fp16_dtype_0 = const()[name = tensor<string, []>("x_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [64, 64, 1, 1]> proj_weight_to_fp16 = const()[name = tensor<string, []>("proj_weight_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 64, 1, 4]> x_to_fp16 = cast(dtype = x_to_fp16_dtype_0, x = x)[name = tensor<string, []>("cast_1")];
            tensor<fp16, [1, 64, 1, 4]> var_13_cast_fp16 = conv(dilations = var_13_dilations_0, groups = var_13_groups_0, pad = var_13_pad_0, pad_type = var_13_pad_type_0, strides = var_13_strides_0, weight = proj_weight_to_fp16, x = x_to_fp16)[name = tensor<string, []>("op_13_cast_fp16")];
            tensor<string, []> var_13_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("op_13_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp32, [1, 64, 1, 4]> var_13 = cast(dtype = var_13_cast_fp16_to_fp32_dtype_0, x = var_13_cast_fp16)[name = tensor<string, []>("cast_0")];
        } -> (var_13);
}